app/controllers/admin_controller.rb

SELECT * FROM `investments` ORDER BY updated_at
---
  def index
    @errorMsg = ""
    @online_offline = "offline"

    if (!$sessionID.blank?)
      getAccountData($sessionID)
    end

    @all_investments = Investment.find_all